MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECG064/mcu.h
  .extern IC8CONINV        /* 0xBF842E0C */
  .extern IC8BUF           /* 0xBF842E10 */
  .extern IC9CON           /* 0xBF843000 */
  .extern IC9CONCLR        /* 0xBF843004 */
  .extern IC9CONSET        /* 0xBF843008 */
  .extern IC9CONINV        /* 0xBF84300C */
  .extern IC9BUF           /* 0xBF843010 */
  .extern OC1CON           /* 0xBF844000 */
  .extern OC1CONCLR        /* 0xBF844004 */
  .extern OC1CONSET        /* 0xBF844008 */
  .extern OC1CONINV        /* 0xBF84400C */
  .extern OC1R             /* 0xBF844010 */
  .extern OC1RCLR          /* 0xBF844014 */
  .extern OC1RSET          /* 0xBF844018 */
  .extern OC1RINV          /* 0xBF84401C */
  .extern OC1RS            /* 0xBF844020 */
  .extern OC1RSCLR         /* 0xBF844024 */
  .extern OC1RSSET         /* 0xBF844028 */
  .extern OC1RSINV         /* 0xBF84402C */
  .extern OC2CON           /* 0xBF844200 */
  .extern OC2CONCLR        /* 0xBF844204 */
  .extern OC2CONSET        /* 0xBF844208 */
  .extern OC2CONINV        /* 0xBF84420C */
  .extern OC2R             /* 0xBF844210 */
  .extern OC2RCLR          /* 0xBF844214 */
  .extern OC2RSET          /* 0xBF844218 */
  .extern OC2RINV          /* 0xBF84421C */
  .extern OC2RS            /* 0xBF844220 */
  .extern OC2RSCLR         /* 0xBF844224 */
  .extern OC2RSSET         /* 0xBF844228 */
  .extern OC2RSINV         /* 0xBF84422C */
  .extern OC3CON           /* 0xBF844400 */
  .extern OC3CONCLR        /* 0xBF844404 */
  .extern OC3CONSET        /* 0xBF844408 */
  .extern OC3CONINV        /* 0xBF84440C */
  .extern OC3R             /* 0xBF844410 */
  .extern OC3RCLR          /* 0xBF844414 */
  .extern OC3RSET          /* 0xBF844418 */
  .extern OC3RINV          /* 0xBF84441C */
  .extern OC3RS            /* 0xBF844420 */
  .extern OC3RSCLR         /* 0xBF844424 */
  .extern OC3RSSET         /* 0xBF844428 */
  .extern OC3RSINV         /* 0xBF84442C */
  .extern OC4CON           /* 0xBF844600 */
  .extern OC4CONCLR        /* 0xBF844604 */
  .extern OC4CONSET        /* 0xBF844608 */
  .extern OC4CONINV        /* 0xBF84460C */
  .extern OC4R             /* 0xBF844610 */
  .extern OC4RCLR          /* 0xBF844614 */
  .extern OC4RSET          /* 0xBF844618 */
  .extern OC4RINV          /* 0xBF84461C */
  .extern OC4RS            /* 0xBF844620 */
  .extern OC4RSCLR         /* 0xBF844624 */
  .extern OC4RSSET         /* 0xBF844628 */
  .extern OC4RSINV         /* 0xBF84462C */
  .extern OC5CON           /* 0xBF844800 */
  .extern OC5CONCLR        /* 0xBF844804 */
  .extern OC5CONSET        /* 0xBF844808 */
  .extern OC5CONINV        /* 0xBF84480C */
  .extern OC5R             /* 0xBF844810 */
  .extern OC5RCLR          /* 0xBF844814 */
  .extern OC5RSET          /* 0xBF844818 */
  .extern OC5RINV          /* 0xBF84481C */
  .extern OC5RS            /* 0xBF844820 */
  .extern OC5RSCLR         /* 0xBF844824 */
  .extern OC5RSSET         /* 0xBF844828 */
  .extern OC5RSINV         /* 0xBF84482C */
  .extern OC6CON           /* 0xBF844A00 */
  .extern OC6CONCLR        /* 0xBF844A04 */
  .extern OC6CONSET        /* 0xBF844A08 */
  .extern OC6CONINV        /* 0xBF844A0C */
  .extern OC6R             /* 0xBF844A10 */
  .extern OC6RCLR          /* 0xBF844A14 */
  .extern OC6RSET          /* 0xBF844A18 */
  .extern OC6RINV          /* 0xBF844A1C */
  .extern OC6RS            /* 0xBF844A20 */
  .extern OC6RSCLR         /* 0xBF844A24 */
  .extern OC6RSSET         /* 0xBF844A28 */
  .extern OC6RSINV         /* 0xBF844A2C */
  .extern OC7CON           /* 0xBF844C00 */
  .extern OC7CONCLR        /* 0xBF844C04 */
  .extern OC7CONSET        /* 0xBF844C08 */
  .extern OC7CONINV        /* 0xBF844C0C */
  .extern OC7R             /* 0xBF844C10 */
  .extern OC7RCLR          /* 0xBF844C14 */
  .extern OC7RSET          /* 0xBF844C18 */
  .extern OC7RINV          /* 0xBF844C1C */
  .extern OC7RS            /* 0xBF844C20 */
  .extern OC7RSCLR         /* 0xBF844C24 */
  .extern OC7RSSET         /* 0xBF844C28 */
  .extern OC7RSINV         /* 0xBF844C2C */
  .extern OC8CON           /* 0xBF844E00 */
  .extern OC8CONCLR        /* 0xBF844E04 */
  .extern OC8CONSET        /* 0xBF844E08 */
  .extern OC8CONINV        /* 0xBF844E0C */
  .extern OC8R             /* 0xBF844E10 */
  .extern OC8RCLR          /* 0xBF844E14 */
  .extern OC8RSET          /* 0xBF844E18 */
  .extern OC8RINV          /* 0xBF844E1C */
  .extern OC8RS            /* 0xBF844E20 */
  .extern OC8RSCLR         /* 0xBF844E24 */
  .extern OC8RSSET         /* 0xBF844E28 */
  .extern OC8RSINV         /* 0xBF844E2C */
  .extern OC9CON           /* 0xBF845000 */
  .extern OC9CONCLR        /* 0xBF845004 */
  .extern OC9CONSET        /* 0xBF845008 */
  .extern OC9CONINV        /* 0xBF84500C */
  .extern OC9R             /* 0xBF845010 */
  .extern OC9RCLR          /* 0xBF845014 */
  .extern OC9RSET          /* 0xBF845018 */
  .extern OC9RINV          /* 0xBF84501C */
  .extern OC9RS            /* 0xBF845020 */
  .extern OC9RSCLR         /* 0xBF845024 */
  .extern OC9RSSET         /* 0xBF845028 */
  .extern OC9RSINV         /* 0xBF84502C */
  .extern AD1CON1          /* 0xBF84B000 */
  .extern AD1CON2          /* 0xBF84B004 */
  .extern AD1CON3          /* 0xBF84B008 */
  .extern AD1IMOD          /* 0xBF84B00C */
  .extern AD1GIRQEN1       /* 0xBF84B010 */
  .extern AD1GIRQEN2       /* 0xBF84B014 */
  .extern AD1CSS1          /* 0xBF84B018 */
  .extern AD1CSS2          /* 0xBF84B01C */
  .extern AD1DSTAT1        /* 0xBF84B020 */
  .extern AD1DSTAT2        /* 0xBF84B024 */
  .extern AD1CMPEN1        /* 0xBF84B028 */
  .extern AD1CMP1          /* 0xBF84B02C */
  .extern AD1CMPEN2        /* 0xBF84B030 */
  .extern AD1CMP2          /* 0xBF84B034 */
  .extern AD1CMPEN3        /* 0xBF84B038 */
  .extern AD1CMP3          /* 0xBF84B03C */
  .extern AD1CMPEN4        /* 0xBF84B040 */
  .extern AD1CMP4          /* 0xBF84B044 */
  .extern AD1CMPEN5        /* 0xBF84B048 */
  .extern AD1CMP5          /* 0xBF84B04C */
  .extern AD1CMPEN6        /* 0xBF84B050 */
  .extern AD1CMP6          /* 0xBF84B054 */
  .extern AD1FLTR1         /* 0xBF84B058 */
  .extern AD1FLTR2         /* 0xBF84B05C */
  .extern AD1FLTR3         /* 0xBF84B060 */
  .extern AD1FLTR4         /* 0xBF84B064 */
  .extern AD1FLTR5         /* 0xBF84B068 */
  .extern AD1FLTR6         /* 0xBF84B06C */
  .extern AD1TRG1          /* 0xBF84B070 */
  .extern AD1TRG2          /* 0xBF84B074 */
  .extern AD1TRG3          /* 0xBF84B078 */
  .extern AD1CMPCON1       /* 0xBF84B090 */
  .extern AD1CMPCON2       /* 0xBF84B094 */
  .extern AD1CMPCON3       /* 0xBF84B098 */
  .extern AD1CMPCON4       /* 0xBF84B09C */
  .extern AD1CMPCON5       /* 0xBF84B0A0 */
  .extern AD1CMPCON6       /* 0xBF84B0A4 */
  .extern AD1DATA0         /* 0xBF84B0B8 */
  .extern AD1DATA1         /* 0xBF84B0BC */
  .extern AD1DATA2         /* 0xBF84B0C0 */
  .extern AD1DATA3         /* 0xBF84B0C4 */
  .extern AD1DATA4         /* 0xBF84B0C8 */
  .extern AD1DATA5         /* 0xBF84B0CC */
  .extern AD1DATA6         /* 0xBF84B0D0 */
  .extern AD1DATA7         /* 0xBF84B0D4 */
  .extern AD1DATA8         /* 0xBF84B0D8 */
  .extern AD1DATA9         /* 0xBF84B0DC */
  .extern AD1DATA10        /* 0xBF84B0E0 */
  .extern AD1DATA11        /* 0xBF84B0E4 */
  .extern AD1DATA12        /* 0xBF84B0E8 */
  .extern AD1DATA13        /* 0xBF84B0EC */
  .extern AD1DATA14        /* 0xBF84B0F0 */
  .extern AD1DATA15        /* 0xBF84B0F4 */
  .extern AD1DATA16        /* 0xBF84B0F8 */
  .extern AD1DATA17        /* 0xBF84B0FC */
  .extern AD1DATA18        /* 0xBF84B100 */
  .extern AD1DATA43        /* 0xBF84B164 */
  .extern AD1DATA44        /* 0xBF84B168 */
  .extern AD1CAL1          /* 0xBF84B200 */
  .extern AD1CAL2          /* 0xBF84B204 */
  .extern AD1CAL3          /* 0xBF84B208 */
  .extern AD1CAL4          /* 0xBF84B20C */
  .extern AD1CAL5          /* 0xBF84B210 */
  .extern CM1CON           /* 0xBF84C000 */
  .extern CM1CONCLR        /* 0xBF84C004 */
  .extern CM1CONSET        /* 0xBF84C008 */
  .extern CM1CONINV        /* 0xBF84C00C */
  .extern CM2CON           /* 0xBF84C010 */
  .extern CM2CONCLR        /* 0xBF84C014 */
  .extern CM2CONSET        /* 0xBF84C018 */
  .extern CM2CONINV        /* 0xBF84C01C */
  .extern CMSTAT           /* 0xBF84C060 */
  .extern CMSTATCLR        /* 0xBF84C064 */
  .extern CMSTATSET        /* 0xBF84C068 */
  .extern CMSTATINV        /* 0xBF84C06C */
  .extern ANSELB           /* 0xBF860100 */
  .extern ANSELBCLR        /* 0xBF860104 */
  .extern ANSELBSET        /* 0xBF860108 */
  .extern ANSELBINV        /* 0xBF86010C */
  .extern TRISB            /* 0xBF860110 */
  .extern TRISBCLR         /* 0xBF860114 */
  .extern TRISBSET         /* 0xBF860118 */
  .extern TRISBINV         /* 0xBF86011C */
  .extern PORTB            /* 0xBF860120 */
  .extern PORTBCLR         /* 0xBF860124 */
  .extern PORTBSET         /* 0xBF860128 */
  .extern PORTBINV         /* 0xBF86012C */
  .extern LATB             /* 0xBF860130 */
  .extern LATBCLR          /* 0xBF860134 */
  .extern LATBSET          /* 0xBF860138 */
  .extern LATBINV          /* 0xBF86013C */
  .extern ODCB             /* 0xBF860140 */
  .extern ODCBCLR          /* 0xBF860144 */
  .extern ODCBSET          /* 0xBF860148 */
  .extern ODCBINV          /* 0xBF86014C */
  .extern CNPUB            /* 0xBF860150 */
  .extern CNPUBCLR         /* 0xBF860154 */
  .extern CNPUBSET         /* 0xBF860158 */
  .extern CNPUBINV         /* 0xBF86015C */
  .extern CNPDB            /* 0xBF860160 */
  .extern CNPDBCLR         /* 0xBF860164 */
  .extern CNPDBSET         /* 0xBF860168 */
  .extern CNPDBINV         /* 0xBF86016C */
  .extern CNCONB           /* 0xBF860170 */
  .extern CNCONBCLR        /* 0xBF860174 */
  .extern CNCONBSET        /* 0xBF860178 */
  .extern CNCONBINV        /* 0xBF86017C */
  .extern CNENB            /* 0xBF860180 */
  .extern CNENBCLR         /* 0xBF860184 */
  .extern CNENBSET         /* 0xBF860188 */
  .extern CNENBINV         /* 0xBF86018C */
  .extern CNSTATB          /* 0xBF860190 */
  .extern CNSTATBCLR       /* 0xBF860194 */
  .extern CNSTATBSET       /* 0xBF860198 */
  .extern CNSTATBINV       /* 0xBF86019C */
  .extern ANSELC           /* 0xBF860200 */
  .extern ANSELCCLR        /* 0xBF860204 */
  .extern ANSELCSET        /* 0xBF860208 */
  .extern ANSELCINV        /* 0xBF86020C */
  .extern TRISC            /* 0xBF860210 */
  .extern TRISCCLR         /* 0xBF860214 */
  .extern TRISCSET         /* 0xBF860218 */
  .extern TRISCINV         /* 0xBF86021C */
  .extern PORTC            /* 0xBF860220 */
  .extern PORTCCLR         /* 0xBF860224 */
  .extern PORTCSET         /* 0xBF860228 */
  .extern PORTCINV         /* 0xBF86022C */
  .extern LATC             /* 0xBF860230 */
  .extern LATCCLR          /* 0xBF860234 */
  .extern LATCSET          /* 0xBF860238 */
  .extern LATCINV          /* 0xBF86023C */
  .extern ODCC             /* 0xBF860240 */
  .extern ODCCCLR          /* 0xBF860244 */
  .extern ODCCSET          /* 0xBF860248 */
  .extern ODCCINV          /* 0xBF86024C */
  .extern CNPUC            /* 0xBF860250 */
  .extern CNPUCCLR         /* 0xBF860254 */
  .extern CNPUCSET         /* 0xBF860258 */
  .extern CNPUCINV         /* 0xBF86025C */
  .extern CNPDC            /* 0xBF860260 */
  .extern CNPDCCLR         /* 0xBF860264 */
  .extern CNPDCSET         /* 0xBF860268 */
  .extern CNPDCINV         /* 0xBF86026C */
  .extern CNCONC           /* 0xBF860270 */
  .extern CNCONCCLR        /* 0xBF860274 */
  .extern CNCONCSET        /* 0xBF860278 */
  .extern CNCONCINV        /* 0xBF86027C */
  .extern CNENC            /* 0xBF860280 */
  .extern CNENCCLR         /* 0xBF860284 */
  .extern CNENCSET         /* 0xBF860288 */
  .extern CNENCINV         /* 0xBF86028C */
  .extern CNSTATC          /* 0xBF860290 */
  .extern CNSTATCCLR       /* 0xBF860294 */
  .extern CNSTATCSET       /* 0xBF860298 */
  .extern CNSTATCINV       /* 0xBF86029C */
  .extern ANSELD           /* 0xBF860300 */
  .extern ANSELDCLR        /* 0xBF860304 */
  .extern ANSELDSET        /* 0xBF860308 */
  .extern ANSELDINV        /* 0xBF86030C */
  .extern TRISD            /* 0xBF860310 */
  .extern TRISDCLR         /* 0xBF860314 */
  .extern TRISDSET         /* 0xBF860318 */
  .extern TRISDINV         /* 0xBF86031C */
  .extern PORTD            /* 0xBF860320 */
  .extern PORTDCLR         /* 0xBF860324 */
  .extern PORTDSET         /* 0xBF860328 */
  .extern PORTDINV         /* 0xBF86032C */
  .extern LATD             /* 0xBF860330 */
  .extern LATDCLR          /* 0xBF860334 */
  .extern LATDSET          /* 0xBF860338 */
  .extern LATDINV          /* 0xBF86033C */
  .extern ODCD             /* 0xBF860340 */
  .extern ODCDCLR          /* 0xBF860344 */
  .extern ODCDSET          /* 0xBF860348 */
  .extern ODCDINV          /* 0xBF86034C */
  .extern CNPUD            /* 0xBF860350 */
  .extern CNPUDCLR         /* 0xBF860354 */
  .extern CNPUDSET         /* 0xBF860358 */
  .extern CNPUDINV         /* 0xBF86035C */
  .extern CNPDD            /* 0xBF860360 */
  .extern CNPDDCLR         /* 0xBF860364 */
  .extern CNPDDSET         /* 0xBF860368 */
  .extern CNPDDINV         /* 0xBF86036C */
  .extern CNCOND           /* 0xBF860370 */
  .extern CNCONDCLR        /* 0xBF860374 */
  .extern CNCONDSET        /* 0xBF860378 */
  .extern CNCONDINV        /* 0xBF86037C */
  .extern CNEND            /* 0xBF860380 */
  .extern CNENDCLR         /* 0xBF860384 */
  .extern CNENDSET         /* 0xBF860388 */
  .extern CNENDINV         /* 0xBF86038C */
  .extern CNSTATD          /* 0xBF860390 */
  .extern CNSTATDCLR       /* 0xBF860394 */
  .extern CNSTATDSET       /* 0xBF860398 */
  .extern CNSTATDINV       /* 0xBF86039C */
  .extern ANSELE           /* 0xBF860400 */
  .extern ANSELECLR        /* 0xBF860404 */
  .extern ANSELESET        /* 0xBF860408 */
  .extern ANSELEINV        /* 0xBF86040C */
  .extern TRISE            /* 0xBF860410 */
  .extern TRISECLR         /* 0xBF860414 */
  .extern TRISESET         /* 0xBF860418 */
  .extern TRISEINV         /* 0xBF86041C */
  .extern PORTE            /* 0xBF860420 */
  .extern PORTECLR         /* 0xBF860424 */
  .extern PORTESET         /* 0xBF860428 */
  .extern PORTEINV         /* 0xBF86042C */
  .extern LATE             /* 0xBF860430 */
  .extern LATECLR          /* 0xBF860434 */
  .extern LATESET          /* 0xBF860438 */
  .extern LATEINV          /* 0xBF86043C */
  .extern ODCE             /* 0xBF860440 */
  .extern ODCECLR          /* 0xBF860444 */
  .extern ODCESET          /* 0xBF860448 */
  .extern ODCEINV          /* 0xBF86044C */
  .extern CNPUE            /* 0xBF860450 */
  .extern CNPUECLR         /* 0xBF860454 */
  .extern CNPUESET         /* 0xBF860458 */
  .extern CNPUEINV         /* 0xBF86045C */
  .extern CNPDE            /* 0xBF860460 */
  .extern CNPDECLR         /* 0xBF860464 */
  .extern CNPDESET         /* 0xBF860468 */
  .extern CNPDEINV         /* 0xBF86046C */
  .extern CNCONE           /* 0xBF860470 */
  .extern CNCONECLR        /* 0xBF860474 */
  .extern CNCONESET        /* 0xBF860478 */
  .extern CNCONEINV        /* 0xBF86047C */
  .extern CNENE            /* 0xBF860480 */
  .extern CNENECLR         /* 0xBF860484 */
  .extern CNENESET         /* 0xBF860488 */
  .extern CNENEINV         /* 0xBF86048C */
  .extern CNSTATE          /* 0xBF860490 */
  .extern CNSTATECLR       /* 0xBF860494 */
  .extern CNSTATESET       /* 0xBF860498 */
  .extern CNSTATEINV       /* 0xBF86049C */
  .extern ANSELF           /* 0xBF860500 */
  .extern ANSELFCLR        /* 0xBF860504 */
  .extern ANSELFSET        /* 0xBF860508 */
  .extern ANSELFINV        /* 0xBF86050C */
  .extern TRISF            /* 0xBF860510 */
  .extern TRISFCLR         /* 0xBF860514 */
  .extern TRISFSET         /* 0xBF860518 */
  .extern TRISFINV         /* 0xBF86051C */
  .extern PORTF            /* 0xBF860520 */
  .extern PORTFCLR         /* 0xBF860524 */
  .extern PORTFSET         /* 0xBF860528 */
  .extern PORTFINV         /* 0xBF86052C */
  .extern LATF             /* 0xBF860530 */
  .extern LATFCLR          /* 0xBF860534 */
  .extern LATFSET          /* 0xBF860538 */
  .extern LATFINV          /* 0xBF86053C */
  .extern ODCF             /* 0xBF860540 */
  .extern ODCFCLR          /* 0xBF860544 */
  .extern ODCFSET          /* 0xBF860548 */
  .extern ODCFINV          /* 0xBF86054C */
  .extern CNPUF            /* 0xBF860550 */
  .extern CNPUFCLR         /* 0xBF860554 */
  .extern CNPUFSET         /* 0xBF860558 */
  .extern CNPUFINV         /* 0xBF86055C */
  .extern CNPDF            /* 0xBF860560 */
  .extern CNPDFCLR         /* 0xBF860564 */
  .extern CNPDFSET         /* 0xBF860568 */
  .extern CNPDFINV         /* 0xBF86056C */
  .extern CNCONF           /* 0xBF860570 */
  .extern CNCONFCLR        /* 0xBF860574 */
  .extern CNCONFSET        /* 0xBF860578 */
  .extern CNCONFINV        /* 0xBF86057C */
  .extern CNENF            /* 0xBF860580 */
  .extern CNENFCLR         /* 0xBF860584 */
  .extern CNENFSET         /* 0xBF860588 */
  .extern CNENFINV         /* 0xBF86058C */
  .extern CNSTATF          /* 0xBF860590 */
  .extern CNSTATFCLR       /* 0xBF860594 */
  .extern CNSTATFSET       /* 0xBF860598 */
  .extern CNSTATFINV       /* 0xBF86059C */
  .extern ANSELG           /* 0xBF860600 */
  .extern ANSELGCLR        /* 0xBF860604 */
  .extern ANSELGSET        /* 0xBF860608 */
  .extern ANSELGINV        /* 0xBF86060C */
  .extern TRISG            /* 0xBF860610 */
  .extern TRISGCLR         /* 0xBF860614 */
  .extern TRISGSET         /* 0xBF860618 */
  .extern TRISGINV         /* 0xBF86061C */
  .extern PORTG            /* 0xBF860620 */
  .extern PORTGCLR         /* 0xBF860624 */
  .extern PORTGSET         /* 0xBF860628 */
  .extern PORTGINV         /* 0xBF86062C */
  .extern LATG             /* 0xBF860630 */
  .extern LATGCLR          /* 0xBF860634 */
  .extern LATGSET          /* 0xBF860638 */
  .extern LATGINV          /* 0xBF86063C */
  .extern ODCG             /* 0xBF860640 */
  .extern ODCGCLR          /* 0xBF860644 */
  .extern ODCGSET          /* 0xBF860648 */
  .extern ODCGINV          /* 0xBF86064C */
  .extern CNPUG            /* 0xBF860650 */
  .extern CNPUGCLR         /* 0xBF860654 */
  .extern CNPUGSET         /* 0xBF860658 */
  .extern CNPUGINV         /* 0xBF86065C */
  .extern CNPDG            /* 0xBF860660 */
  .extern CNPDGCLR         /* 0xBF860664 */
  .extern CNPDGSET         /* 0xBF860668 */
  .extern CNPDGINV         /* 0xBF86066C */
  .extern CNCONG           /* 0xBF860670 */
  .extern CNCONGCLR        /* 0xBF860674 */
  .extern CNCONGSET        /* 0xBF860678 */
  .extern CNCONGINV        /* 0xBF86067C */
  .extern CNENG            /* 0xBF860680 */
  .extern CNENGCLR         /* 0xBF860684 */
  .extern CNENGSET         /* 0xBF860688 */
  .extern CNENGINV         /* 0xBF86068C */
  .extern CNSTATG          /* 0xBF860690 */
  .extern CNSTATGCLR       /* 0xBF860694 */
  .extern CNSTATGSET       /* 0xBF860698 */
  .extern CNSTATGINV       /* 0xBF86069C */
  .extern ETHCON1          /* 0xBF882000 */
  .extern ETHCON1CLR       /* 0xBF882004 */
  .extern ETHCON1SET       /* 0xBF882008 */
  .extern ETHCON1INV       /* 0xBF88200C */
  .extern ETHCON2          /* 0xBF882010 */
  .extern ETHCON2CLR       /* 0xBF882014 */
  .extern ETHCON2SET       /* 0xBF882018 */
  .extern ETHCON2INV       /* 0xBF88201C */
  .extern ETHTXST          /* 0xBF882020 */
  .extern ETHTXSTCLR       /* 0xBF882024 */
  .extern ETHTXSTSET       /* 0xBF882028 */
  .extern ETHTXSTINV       /* 0xBF88202C */
  .extern ETHRXST          /* 0xBF882030 */
  .extern ETHRXSTCLR       /* 0xBF882034 */
  .extern ETHRXSTSET       /* 0xBF882038 */
  .extern ETHRXSTINV       /* 0xBF88203C */
  .extern ETHHT0           /* 0xBF882040 */
  .extern ETHHT0CLR        /* 0xBF882044 */
  .extern ETHHT0SET        /* 0xBF882048 */
  .extern ETHHT0INV        /* 0xBF88204C */
  .extern ETHHT1           /* 0xBF882050 */
  .extern ETHHT1CLR        /* 0xBF882054 */
  .extern ETHHT1SET        /* 0xBF882058 */
  .extern ETHHT1INV        /* 0xBF88205C */
  .extern ETHPMM0          /* 0xBF882060 */
  .extern ETHPMM0CLR       /* 0xBF882064 */
  .extern ETHPMM0SET       /* 0xBF882068 */
  .extern ETHPMM0INV       /* 0xBF88206C */
  .extern ETHPMM1          /* 0xBF882070 */
  .extern ETHPMM1CLR       /* 0xBF882074 */
  .extern ETHPMM1SET       /* 0xBF882078 */
  .extern ETHPMM1INV       /* 0xBF88207C */
  .extern ETHPMCS          /* 0xBF882080 */
  .extern ETHPMCSCLR       /* 0xBF882084 */
  .extern ETHPMCSSET       /* 0xBF882088 */
  .extern ETHPMCSINV       /* 0xBF88208C */
  .extern ETHPMO           /* 0xBF882090 */
  .extern ETHPMOCLR        /* 0xBF882094 */
  .extern ETHPMOSET        /* 0xBF882098 */
  .extern ETHPMOINV        /* 0xBF88209C */
  .extern ETHRXFC          /* 0xBF8820A0 */
  .extern ETHRXFCCLR       /* 0xBF8820A4 */
  .extern ETHRXFCSET       /* 0xBF8820A8 */
  .extern ETHRXFCINV       /* 0xBF8820AC */
  .extern ETHRXWM          /* 0xBF8820B0 */
  .extern ETHRXWMCLR       /* 0xBF8820B4 */
  .extern ETHRXWMSET       /* 0xBF8820B8 */
  .extern ETHRXWMINV       /* 0xBF8820BC */
  .extern ETHIEN           /* 0xBF8820C0 */
  .extern ETHIENCLR        /* 0xBF8820C4 */
  .extern ETHIENSET        /* 0xBF8820C8 */
  .extern ETHIENINV        /* 0xBF8820CC */
  .extern ETHIRQ           /* 0xBF8820D0 */
  .extern ETHIRQCLR        /* 0xBF8820D4 */
  .extern ETHIRQSET        /* 0xBF8820D8 */
  .extern ETHIRQINV        /* 0xBF8820DC */
  .extern ETHSTAT          /* 0xBF8820E0 */
  .extern ETHSTATCLR       /* 0xBF8820E4 */
  .extern ETHSTATSET       /* 0xBF8820E8 */
  .extern ETHSTATINV       /* 0xBF8820EC */
  .extern ETHRXOVFLOW      /* 0xBF882100 */
  .extern ETHRXOVFLOWCLR   /* 0xBF882104 */
  .extern ETHRXOVFLOWSET   /* 0xBF882108 */
  .extern ETHRXOVFLOWINV   /* 0xBF88210C */
  .extern ETHFRMTXOK       /* 0xBF882110 */
  .extern ETHFRMTXOKCLR    /* 0xBF882114 */
  .extern ETHFRMTXOKSET    /* 0xBF882118 */
  .extern ETHFRMTXOKINV    /* 0xBF88211C */
  .extern ETHSCOLFRM       /* 0xBF882120 */
  .extern ETHSCOLFRMCLR    /* 0xBF882124 */
  .extern ETHSCOLFRMSET    /* 0xBF882128 */
  .extern ETHSCOLFRMINV    /* 0xBF88212C */
  .extern ETHMCOLFRM       /* 0xBF882130 */
  .extern ETHMCOLFRMCLR    /* 0xBF882134 */
  .extern ETHMCOLFRMSET    /* 0xBF882138 */
  .extern ETHMCOLFRMINV    /* 0xBF88213C */
  .extern ETHFRMRXOK       /* 0xBF882140 */
  .extern ETHFRMRXOKCLR    /* 0xBF882144 */
  .extern ETHFRMRXOKSET    /* 0xBF882148 */
  .extern ETHFRMRXOKINV    /* 0xBF88214C */
  .extern ETHFCSERR        /* 0xBF882150 */
  .extern ETHFCSERRCLR     /* 0xBF882154 */
  .extern ETHFCSERRSET     /* 0xBF882158 */
  .extern ETHFCSERRINV     /* 0xBF88215C */
  .extern ETHALGNERR       /* 0xBF882160 */
  .extern ETHALGNERRCLR    /* 0xBF882164 */
  .extern ETHALGNERRSET    /* 0xBF882168 */
  .extern ETHALGNERRINV    /* 0xBF88216C */
  .extern EMAC1CFG1        /* 0xBF882200 */
  .extern EMACxCFG1        /* 0xBF882200 */
  .extern EMAC1CFG1CLR     /* 0xBF882204 */
  .extern EMACxCFG1CLR     /* 0xBF882204 */
  .extern EMAC1CFG1SET     /* 0xBF882208 */
  .extern EMACxCFG1SET     /* 0xBF882208 */
  .extern EMAC1CFG1INV     /* 0xBF88220C */
  .extern EMACxCFG1INV     /* 0xBF88220C */
  .extern EMAC1CFG2        /* 0xBF882210 */
  .extern EMACxCFG2        /* 0xBF882210 */
  .extern EMAC1CFG2CLR     /* 0xBF882214 */
  .extern EMACxCFG2CLR     /* 0xBF882214 */
  .extern EMAC1CFG2SET     /* 0xBF882218 */
  .extern EMACxCFG2SET     /* 0xBF882218 */
  .extern EMAC1CFG2INV     /* 0xBF88221C */
  .extern EMACxCFG2INV     /* 0xBF88221C */
  .extern EMAC1IPGT        /* 0xBF882220 */
  .extern EMACxIPGT        /* 0xBF882220 */
  .extern EMAC1IPGTCLR     /* 0xBF882224 */
  .extern EMACxIPGTCLR     /* 0xBF882224 */
  .extern EMAC1IPGTSET     /* 0xBF882228 */
  .extern EMACxIPGTSET     /* 0xBF882228 */
  .extern EMAC1IPGTINV     /* 0xBF88222C */
  .extern EMACxIPGTINV     /* 0xBF88222C */
  .extern EMAC1IPGR        /* 0xBF882230 */
  .extern EMACxIPGR        /* 0xBF882230 */
  .extern EMAC1IPGRCLR     /* 0xBF882234 */
