MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECG064/mcu.h
#define _IPC17_AD1D10IS_POSITION                 0x00000008
#define _IPC17_AD1D10IS_MASK                     0x00000300
#define _IPC17_AD1D10IS_LENGTH                   0x00000002

#define _IPC17_AD1D10IP_POSITION                 0x0000000A
#define _IPC17_AD1D10IP_MASK                     0x00001C00
#define _IPC17_AD1D10IP_LENGTH                   0x00000003

#define _IPC17_AD1D11IS_POSITION                 0x00000010
#define _IPC17_AD1D11IS_MASK                     0x00030000
#define _IPC17_AD1D11IS_LENGTH                   0x00000002

#define _IPC17_AD1D11IP_POSITION                 0x00000012
#define _IPC17_AD1D11IP_MASK                     0x001C0000
#define _IPC17_AD1D11IP_LENGTH                   0x00000003

#define _IPC17_AD1D12IS_POSITION                 0x00000018
#define _IPC17_AD1D12IS_MASK                     0x03000000
#define _IPC17_AD1D12IS_LENGTH                   0x00000002

#define _IPC17_AD1D12IP_POSITION                 0x0000001A
#define _IPC17_AD1D12IP_MASK                     0x1C000000
#define _IPC17_AD1D12IP_LENGTH                   0x00000003

#define _IPC17_w_POSITION                        0x00000000
#define _IPC17_w_MASK                            0xFFFFFFFF
#define _IPC17_w_LENGTH                          0x00000020

#define _IPC18_AD1D13IS_POSITION                 0x00000000
#define _IPC18_AD1D13IS_MASK                     0x00000003
#define _IPC18_AD1D13IS_LENGTH                   0x00000002

#define _IPC18_AD1D13IP_POSITION                 0x00000002
#define _IPC18_AD1D13IP_MASK                     0x0000001C
#define _IPC18_AD1D13IP_LENGTH                   0x00000003

#define _IPC18_AD1D14IS_POSITION                 0x00000008
#define _IPC18_AD1D14IS_MASK                     0x00000300
#define _IPC18_AD1D14IS_LENGTH                   0x00000002

#define _IPC18_AD1D14IP_POSITION                 0x0000000A
#define _IPC18_AD1D14IP_MASK                     0x00001C00
#define _IPC18_AD1D14IP_LENGTH                   0x00000003

#define _IPC18_AD1D15IS_POSITION                 0x00000010
#define _IPC18_AD1D15IS_MASK                     0x00030000
#define _IPC18_AD1D15IS_LENGTH                   0x00000002

#define _IPC18_AD1D15IP_POSITION                 0x00000012
#define _IPC18_AD1D15IP_MASK                     0x001C0000
#define _IPC18_AD1D15IP_LENGTH                   0x00000003

#define _IPC18_AD1D16IS_POSITION                 0x00000018
#define _IPC18_AD1D16IS_MASK                     0x03000000
#define _IPC18_AD1D16IS_LENGTH                   0x00000002

#define _IPC18_AD1D16IP_POSITION                 0x0000001A
#define _IPC18_AD1D16IP_MASK                     0x1C000000
#define _IPC18_AD1D16IP_LENGTH                   0x00000003

#define _IPC18_w_POSITION                        0x00000000
#define _IPC18_w_MASK                            0xFFFFFFFF
#define _IPC18_w_LENGTH                          0x00000020

#define _IPC19_AD1D17IS_POSITION                 0x00000000
#define _IPC19_AD1D17IS_MASK                     0x00000003
#define _IPC19_AD1D17IS_LENGTH                   0x00000002

#define _IPC19_AD1D17IP_POSITION                 0x00000002
#define _IPC19_AD1D17IP_MASK                     0x0000001C
#define _IPC19_AD1D17IP_LENGTH                   0x00000003

#define _IPC19_AD1D18IS_POSITION                 0x00000008
#define _IPC19_AD1D18IS_MASK                     0x00000300
#define _IPC19_AD1D18IS_LENGTH                   0x00000002

#define _IPC19_AD1D18IP_POSITION                 0x0000000A
#define _IPC19_AD1D18IP_MASK                     0x00001C00
#define _IPC19_AD1D18IP_LENGTH                   0x00000003

#define _IPC19_w_POSITION                        0x00000000
#define _IPC19_w_MASK                            0xFFFFFFFF
#define _IPC19_w_LENGTH                          0x00000020

#define _IPC25_AD1D43IS_POSITION                 0x00000010
#define _IPC25_AD1D43IS_MASK                     0x00030000
#define _IPC25_AD1D43IS_LENGTH                   0x00000002

#define _IPC25_AD1D43IP_POSITION                 0x00000012
#define _IPC25_AD1D43IP_MASK                     0x001C0000
#define _IPC25_AD1D43IP_LENGTH                   0x00000003

#define _IPC25_AD1D44IS_POSITION                 0x00000018
#define _IPC25_AD1D44IS_MASK                     0x03000000
#define _IPC25_AD1D44IS_LENGTH                   0x00000002

#define _IPC25_AD1D44IP_POSITION                 0x0000001A
#define _IPC25_AD1D44IP_MASK                     0x1C000000
#define _IPC25_AD1D44IP_LENGTH                   0x00000003

#define _IPC25_w_POSITION                        0x00000000
#define _IPC25_w_MASK                            0xFFFFFFFF
#define _IPC25_w_LENGTH                          0x00000020

#define _IPC26_CPCIS_POSITION                    0x00000000
#define _IPC26_CPCIS_MASK                        0x00000003
#define _IPC26_CPCIS_LENGTH                      0x00000002

#define _IPC26_CPCIP_POSITION                    0x00000002
#define _IPC26_CPCIP_MASK                        0x0000001C
#define _IPC26_CPCIP_LENGTH                      0x00000003

#define _IPC26_CFDCIS_POSITION                   0x00000008
#define _IPC26_CFDCIS_MASK                       0x00000300
#define _IPC26_CFDCIS_LENGTH                     0x00000002

#define _IPC26_CFDCIP_POSITION                   0x0000000A
#define _IPC26_CFDCIP_MASK                       0x00001C00
#define _IPC26_CFDCIP_LENGTH                     0x00000003

#define _IPC26_SBIS_POSITION                     0x00000010
#define _IPC26_SBIS_MASK                         0x00030000
#define _IPC26_SBIS_LENGTH                       0x00000002

#define _IPC26_SBIP_POSITION                     0x00000012
#define _IPC26_SBIP_MASK                         0x001C0000
#define _IPC26_SBIP_LENGTH                       0x00000003

#define _IPC26_w_POSITION                        0x00000000
#define _IPC26_w_MASK                            0xFFFFFFFF
#define _IPC26_w_LENGTH                          0x00000020

#define _IPC27_SPI1EIS_POSITION                  0x00000008
#define _IPC27_SPI1EIS_MASK                      0x00000300
#define _IPC27_SPI1EIS_LENGTH                    0x00000002

#define _IPC27_SPI1EIP_POSITION                  0x0000000A
#define _IPC27_SPI1EIP_MASK                      0x00001C00
#define _IPC27_SPI1EIP_LENGTH                    0x00000003

#define _IPC27_SPI1RXIS_POSITION                 0x00000010
#define _IPC27_SPI1RXIS_MASK                     0x00030000
#define _IPC27_SPI1RXIS_LENGTH                   0x00000002

#define _IPC27_SPI1RXIP_POSITION                 0x00000012
#define _IPC27_SPI1RXIP_MASK                     0x001C0000
#define _IPC27_SPI1RXIP_LENGTH                   0x00000003

#define _IPC27_SPI1TXIS_POSITION                 0x00000018
#define _IPC27_SPI1TXIS_MASK                     0x03000000
#define _IPC27_SPI1TXIS_LENGTH                   0x00000002

#define _IPC27_SPI1TXIP_POSITION                 0x0000001A
#define _IPC27_SPI1TXIP_MASK                     0x1C000000
#define _IPC27_SPI1TXIP_LENGTH                   0x00000003

#define _IPC27_w_POSITION                        0x00000000
#define _IPC27_w_MASK                            0xFFFFFFFF
#define _IPC27_w_LENGTH                          0x00000020

#define _IPC28_U1EIS_POSITION                    0x00000000
#define _IPC28_U1EIS_MASK                        0x00000003
#define _IPC28_U1EIS_LENGTH                      0x00000002

#define _IPC28_U1EIP_POSITION                    0x00000002
#define _IPC28_U1EIP_MASK                        0x0000001C
#define _IPC28_U1EIP_LENGTH                      0x00000003

#define _IPC28_U1RXIS_POSITION                   0x00000008
#define _IPC28_U1RXIS_MASK                       0x00000300
#define _IPC28_U1RXIS_LENGTH                     0x00000002

#define _IPC28_U1RXIP_POSITION                   0x0000000A
#define _IPC28_U1RXIP_MASK                       0x00001C00
#define _IPC28_U1RXIP_LENGTH                     0x00000003

